---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
source: html/23a2b0a2-d89e-6238-cafb-10d9e5f8c157.htm
---
# DirectContext3DHandleSettings Methods

Assigns values of the source settings to this object.